tap "oven-sh/bun"
tap "sdkman/tap"
brew "btop"
brew "code-server", restart_service: :changed
brew "deno"
brew "docker"
brew "eza"
brew "fnm"
brew "fzf"
brew "gettext"
brew "gh"
brew "git"
brew "git-extras"
brew "gping"
brew "libgpg-error"
brew "mysql", restart_service: :changed
brew "neovim"
brew "nginx", restart_service: :changed
brew "onefetch"
brew "pinentry-mac"
brew "pnpm"
brew "redis"
brew "rustup"
brew "starship"
brew "uv"
brew "zoxide"
brew "oven-sh/bun/bun"
brew "sdkman/tap/sdkman-cli"
cask "android-platform-tools"
cask "clash-party"
cask "cursor"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-lxgw-wenkai"
cask "font-monaspace"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "intellij-idea"
cask "kap"
cask "keycastr"
cask "loop"
cask "motrix"
cask "ngrok"
cask "obsidian"
cask "raycast"
cask "screen-studio"
cask "squirrel-app"
cask "switchhosts"
cask "the-unarchiver"
cask "visual-studio-code"
cask "wechat"
